#include <stdio.h>
#include <stddef.h>


int main() {
    int arr[] = {1, 2, 3, 4, 5};
    int *ptr1 = arr; //指向首元素 1
    int *ptr2 = &arr[3]; //指向第4个元素 4

    // 计算指针之间的偏移量
    ptrdiff_t diff = ptr2 - ptr1;

    printf("指针之间的偏移量为：%td\n", diff);

    return 0;
}
/* 
  ┌─────────────────────────────────────────────────────────────────────────────────────────────────────────────────┐
  │ ptrdiff_t 是C语言标准库 <stddef.h> 中定义的一个整数类型，用于存储指针之间的偏移量。                                                           │
  │ 在上面的示例中，我们使用 %td 格式说明符来打印 ptrdiff_t 类型的值。 
  | OUTPUT:      
  | 指针之间的偏移量为：3                                                                │
  └─────────────────────────────────────────────────────────────────────────────────────────────────────────────────┘
 */
